XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Amiccom.SoC_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Amiccom</vendor>
  <url>http://www.amiccom.com.tw/download/Amiccom_DeviceFamilyPack/</url>
  <name>SoC_DFP</name>
  <description>Amiccom ARM Cortex-M0 Device Family Pack Support</description>

  <releases>
    <release version="0.2.3" date="2020-07-28">
      Rename A8125M0 FLM file
    </release>
    <release version="0.2.2" date="2019-04-09">
      Update A3107M0, A3117M0 FLM files
    </release>
    <release version="0.2.1" date="2019-01-17">
      Remove SVD
    </release>
		<release version="0.2.0" date="2019-01-15">
      Add A3107M0, A3117M0, A8125M0 devices
    </release>
		<release version="0.1.5" date="2018-02-26">
      Correct the A8137M0 include file
    </release>
    <release version="0.1.4" date="2018-01-12">
      Update A8137M0 files
    </release>
    <release version="0.1.3" date="2018-01-04">
      Update A8107M0 files
    </release>
    <release version="0.1.2" date="2017-12-07">
      First Release version of Amiccom Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Amiccom</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Amiccom</keyword>
    <keyword>2.4G</keyword>
    <keyword>BLE</keyword>
    <keyword>Sub1G</keyword>
    <keyword>A8137M0</keyword>
    <keyword>A8107M0</keyword>
		<keyword>A3107M0</keyword>
    <keyword>A3117M0</keyword>
		<keyword>A8125M0</keyword>
  </keywords>

  <devices>
    <!-- ************************  Family '2.4GHz Series'  **************************** -->
    <family Dfamily="2.4GHz Series"  Dvendor="Amiccom:147">
      <description>The 2.4GGHz SoC Series 32-bit microcontroller</description>
      <device Dname="A8137M0">
        <processor  Dcore="Cortex-M0" Dclock="16000000"/>
        <compile    header="Device/A8137M/Device/include/register_A8137M0.h"/>
        <!--debug      svd="SVD/A8137M.svd"/-->
        <description>
          A8137M0 is a high performance and low cost 2.4GHz ISM band FSK/GFSK wireless SoC. It integrates M0 micro controller, 64KBytes flash memory, 8KBytes SRAM, Li-Ion battery charger and excellent performance of 2.4GHz RF transceiver.
        </description>
        <memory     id="IROM1"                   start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                   start="0x20000000"  size="0x02000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/AMC1_F7-F5.FLM"  start="0x00000000"  size="0x10000"                   default="1"/>
        <book       name="Documents\A8137M0 Datasheet v0.3 (Preliminary).pdf"           title="A8137M0 Datasheet"/>
        <feature    type="IOs"      n="24"/>
        <feature    type="Timer"  	n="2"		    m="32"/>
        <feature    type="UART"  	  n="3"/>
        <feature    type="SPI"  		n="1"/>
        <feature    type="I2C"  		n="1"/>
        <feature    type="PWM"  		n="8"		    m="8"/>
        <feature    type="VCC"      n="2.0"    	m="3.6"/>
        <feature    type="Temp"     n="-40"     m="85"/>
        <feature    type="QFN"      n="48"/>
      </device>
			<device Dname="A8125M0">
        <processor  Dcore="Cortex-M0" Dclock="16000000"/>
        <compile    header="Device/A8125M/Device/include/A8125M.h"/>
        <!--debug      svd="SVD/A8125M.svd"/-->
        <description>
          A8125M0 is a high performance and low cost 2.4GHz ISM band FSK/GFSK wireless SoC. It integrates M0 micro controller, 128KBytes flash memory and 32KBytes SRAM.
        </description>
        <memory     id="IROM1"                   start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                   start="0x20000000"  size="0x08000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/A8125M0.FLM"     start="0x00000000"  size="0x10000"                   default="1"/>
        <book       name="Documents\A8125M0_Datasheet_v0.1_(Preliminary).pdf"           title="A8125M0 Datasheet"/>
        <feature    type="IOs"      n="24"/>
        <feature    type="Timer"  	n="2"		    m="32"/>
        <feature    type="UART"  	  n="3"/>
        <feature    type="SPI"  		n="2"/>
        <feature    type="I2C"  		n="1"/>
        <feature    type="PWM"  		n="8"		    m="8"/>
        <feature    type="VCC"      n="2.0"    	m="3.6"/>
        <feature    type="Temp"     n="-40"     m="85"/>
        <feature    type="QFN"      n="48"/>
      </device>
    </family>

    <!-- ************************  Family 'BLE Series'  **************************** -->
    <family Dfamily="BLE Series"     Dvendor="Amiccom:147">
      <description>The BLE SoC Series 32-bit microcontroller</description>
      <device Dname="A8107M0">
        <processor  Dcore="Cortex-M0" Dclock="16000000"/>
        <compile    header="Device/A8107M/Device/include/A8107M0.h"/>
        <!--debug      svd="SVD/A8107M.svd"/-->
        <description>
          A8107M0 is a high performance and low cost 2.4GHz FSK/GFSK system-on-chip (SoC) wireless transceiver. With on chip fraction-N synthesizer, it is designed for Bluetooth Low Energy (Bluetooth 5.0 Single mode).
        </description>
        <memory     id="IROM1"                   start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                   start="0x20000000"  size="0x08000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/AMC1_F8.FLM"     start="0x00000000"  size="0x40000"                   default="1"/>
        <book       name="Documents\A8107M0 Datasheet v0.7(Preliminary).pdf"            title="A8107M0 Datasheet"/>
        <feature    type="IOs"      n="31"/>
        <feature    type="Timer"  	n="2"		    m="32"/>
        <feature    type="UART"  	  n="3"/>
        <feature    type="SPI"  		n="1"/>
        <feature    type="I2C"  		n="1"/>
        <feature    type="PWM"  		n="4"		    m="8"/>
        <feature    type="VCC"      n="2.0"    	m="3.6"/>
        <feature    type="Temp"     n="-40"     m="85"/>
        <feature    type="QFN"      n="48"/>
      </device>
			<device Dname="A3107M0">
        <processor  Dcore="Cortex-M0" Dclock="16000000"/>
        <compile    header="Device/A3107M/Device/include/A3107M0.h"/>
        <!--debug      svd="SVD/A3107M.svd"/-->
        <description>
          A3107M0 is a high performance and low cost 2.4GHz FSK/GFSK system-on-chip (SoC) wireless transceiver. With on chip fraction-N synthesizer, it is designed for Bluetooth Low Energy (Bluetooth 5.0 Single mode, master or slave role).
        </description>
        <memory     id="IROM1"                   start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                   start="0x20000000"  size="0x08000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/AMC1_F8.FLM"     start="0x00000000"  size="0x40000"                   default="1"/>
        <book       name="Documents\A3107M0 Datasheet v0.0(Objective).pdf"              title="A3107M0 Datasheet"/>
        <feature    type="IOs"      n="31"/>
        <feature    type="Timer"  	n="2"		    m="32"/>
        <feature    type="UART"  	  n="3"/>
        <feature    type="SPI"  		n="1"/>
        <feature    type="I2C"  		n="1"/>
        <feature    type="PWM"  		n="4"		    m="8"/>
        <feature    type="VCC"      n="2.0"    	m="3.6"/>
        <feature    type="Temp"     n="-40"     m="85"/>
        <feature    type="QFN"      n="48"/>
      </device>
