XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Amiccom.SoC_DFP.pdsc
			<device Dname="A3117M0">
        <processor  Dcore="Cortex-M0" Dclock="16000000"/>
        <compile    header="Device/A3117M/Device/include/A3117M0.h"/>
        <!--debug      svd="SVD/3117M.svd"/-->
        <description>
          A3117M0 is a high performance and low cost 2.4GHz FSK/GFSK system-on-chip (SoC) wireless transceiver. With on chip fraction-N synthesizer, it is designed for Bluetooth Low Energy (Bluetooth 5.0 Single mode).
        </description>
        <memory     id="IROM1"                   start="0x00000000"  size="0x40000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                   start="0x20000000"  size="0x12000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/AMC1_HT_ECC.FLM"     start="0x00000000"  size="0x40000"                   default="1"/>
        <book       name="Documents\A3117M0 Datasheet v0.1(Preliminary).pdf"            title="A3117M0 Datasheet"/>
        <feature    type="IOs"      n="31"/>
        <feature    type="Timer"  	n="2"		    m="32"/>
        <feature    type="UART"  	  n="3"/>
        <feature    type="SPI"  		n="1"/>
        <feature    type="I2C"  		n="1"/>
        <feature    type="PWM"  		n="4"		    m="8"/>
				<feature    type="USBD"  		n="1"/>
        <feature    type="VCC"      n="2.0"    	m="3.6"/>
        <feature    type="Temp"     n="-40"     m="85"/>
        <feature    type="QFN"      n="48"/>
      </device>
    </family>
  </devices>

  <conditions>
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Amiccom CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Amiccom ARM Cortex-M0 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dvendor="Amiccom:147"  Dname="A8107M0"/>
      <accept Dvendor="Amiccom:147"  Dname="A8137M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A3107M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A3117M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A8125M0"/>
    </condition>
    <condition id="2.4GHz Series Device">
      <description>2.4GHz Series Device</description>
      <accept Dvendor="Amiccom:147"  Dname="A8137M0"/>
      <accept Dvendor="Amiccom:147"  Dname="A8107M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A3107M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A3117M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A8125M0"/>
      <require condition="Compiler ARM"/>
    </condition>
    <condition id="BLE Series Device">
      <description>BLE Series Device</description>
      <accept Dvendor="Amiccom:147"  Dname="A8107M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A3107M0"/>
			<accept Dvendor="Amiccom:147"  Dname="A3117M0"/>
      <require condition="Compiler ARM"/>
    </condition>
    <condition id="A8137M0">
      <description>Cortex-M0 MCU</description>
      <accept Dvendor="Amiccom:147"  Dname="A8137M0"/>
      <require condition="Compiler ARM"/>
    </condition>
    <condition id="A8107M0">
      <description>Cortex-M0 MCU</description>
      <accept Dvendor="Amiccom:147"  Dname="A8107M0"/>
      <require condition="Compiler ARM"/>
    </condition>
		<condition id="A3107M0">
      <description>Cortex-M0 MCU</description>
      <accept Dvendor="Amiccom:147"  Dname="A3107M0"/>
      <require condition="Compiler ARM"/>
    </condition>
		<condition id="A3117M0">
      <description>Cortex-M0 MCU</description>
      <accept Dvendor="Amiccom:147"  Dname="A3117M0"/>
      <require condition="Compiler ARM"/>
    </condition>
		<condition id="A8125M0">
      <description>Cortex-M0 MCU</description>
      <accept Dvendor="Amiccom:147"  Dname="A8125M0"/>
      <require condition="Compiler ARM"/>
    </condition>
  </conditions>

  <components>

    <!-- A8137M0 Device:Startup component -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A8137M0">
      <!-- Cversion is necessary -->
      <description>System Startup for A8137M0 Device</description>
      <files>
        <!-- A8137M0 header path -->
        <file category="header" name="Device/A8137M/Device/include/register_A8137M0.h" condition="A8137M0" version="1.0.0"/>
				<file category="header" name="Device/A8137M/Common/include/define.h" condition="A8137M0" version="1.0.0"/>
				<file category="header" name="Device/A8137M/Device/include/system_A8137M0.h" condition="A8137M0" version="1.0.0"/>
        <!-- A8137M0 system file -->
        <file category="source" name="Device/A8137M/Device/source/system_A8137M0.c" attr="config" condition="A8137M0" version="1.0.0"/>
        <!-- A8137M0 startup files -->
        <file category="sourceAsm" name="Device/A8137M/Device/source/startup_A8137M0.s" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
    
		<!-- A8107M0 Device:Startup component -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A8107M0">
      <!-- Cversion is necessary -->
      <description>System Startup for A8107M0 Device</description>
      <files>
        <!-- A8107M0 header path -->
        <file category="header" name="Device/A8107M/Device/include/A8107M0.h" condition="A8107M0" version="1.0.0"/>
				<file category="header" name="Device/A8107M/Device/include/system_A8107M0.h" condition="A8107M0" version="1.0.0"/>
        <!-- A8107M0 system file -->
        <file category="source" name="Device/A8107M/Device/source/system_A8107M0.c" attr="config" condition="A8107M0" version="1.0.0"/>
        <!-- A8107M0 startup files -->
        <file category="sourceAsm" name="Device/A8107M/Device/source/startup_A8107M0.s" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>

		<!-- A3107M0 Device:Startup component -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A3107M0">
      <!-- Cversion is necessary -->
      <description>System Startup for A3107M0 Device</description>
      <files>
        <!-- A3107M0 header path -->
        <file category="header" name="Device/A3107M/Device/include/A3107M0.h" condition="A3107M0" version="1.0.0"/>
				<file category="header" name="Device/A3107M/Device/include/system_A3107M0.h" condition="A3107M0" version="1.0.0"/>
        <!-- A3107M0 system file -->
        <file category="source" name="Device/A3107M/Device/source/system_A3107M0.c" attr="config" condition="A3107M0" version="1.0.0"/>
        <!-- A3107M0 startup files -->
        <file category="sourceAsm" name="Device/A3107M/Device/source/startup_A3107M0.s" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>

		<!-- A3117M0 Device:Startup component -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A3117M0">
      <!-- Cversion is necessary -->
      <description>System Startup for A3117M0 Device</description>
      <files>
        <!-- A3117M0 header path -->
        <file category="header" name="Device/A3117M/Device/include/A3117M0.h" condition="A3117M0" version="1.0.0"/>
				<file category="header" name="Device/A3117M/Device/include/system_A3117M0.h" condition="A3117M0" version="1.0.0"/>
        <!-- A3117M0 system file -->
        <file category="source" name="Device/A3117M/Device/source/system_A3117M0.c" attr="config" condition="A3117M0" version="1.0.0"/>
        <!-- A3117M0 startup files -->
        <file category="sourceAsm" name="Device/A3117M/Device/source/startup_A3117M0.s" attr="config" condition="A3117M0" version="1.0.0"/>
      </files>
    </component>
		
		<!-- A8125M0 Device:Startup component -->
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A8125M0">
      <!-- Cversion is necessary -->
      <description>System Startup for A8125M0 Device</description>
      <files>
        <!-- A8125M0 header path -->
        <file category="header" name="Device/A8125M/Device/include/A8125M.h" condition="A8125M0" version="1.0.0"/>
				<file category="header" name="Device/A8125M/Common/include/define.h" condition="A8125M0" version="1.0.0"/>
        <!-- A8125M0 system file -->
        <file category="source" name="Device/A8125M/Device/source/system_A8125M0.c" attr="config" condition="A8125M0" version="1.0.0"/>
        <!-- A8125M0 startup files -->
        <file category="sourceAsm" name="Device/A8125M/Device/source/startup_A8125M0.s" attr="config" condition="A8125M0" version="1.0.0"/>
      </files>
    </component>
		

		
		
		
		
		
		
		
    <!-- A8137M0 Device:Driver component -->
    <component Cclass="Device" Cgroup="Driver" Csub="DualTimer" Cversion="1.0.0" condition="A8137M0">
      <description>DualTimer driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/dualtimer.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/dualtimer.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
