XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Amiccom.SoC_DFP.pdsc
		<component Cclass="Device" Cgroup="Driver" Csub="GPIO" Cversion="1.0.0" condition="A8137M0">
      <description>GPIO driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/gpio.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/gpio.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="PWM" Cversion="1.0.0" condition="A8137M0">
      <description>PWM driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/pwm.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/pwm.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="Timer" Cversion="1.0.0" condition="A8137M0">
      <description>Timer driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/timer.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/timer.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="UART" Cversion="1.0.0" condition="A8137M0">
      <description>UART driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/uart.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/uart.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="UTI" Cversion="1.0.0" condition="A8137M0">
      <description>Delay driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/uti.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/uti.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="WatchDog" Cversion="1.0.0" condition="A8137M0">
      <description>WatchDog driver for A8137M0 Device</description>
      <files>
        <file category="header" name="Device/A8137M/Driver/include/watchdog.h" condition="A8137M0"/>
        <file category="source" name="Device/A8137M/Driver/source/watchdog.c" attr="config" condition="A8137M0" version="1.0.0"/>
      </files>
    </component>


    <!-- A8107M0 Device:Driver component -->
    <component Cclass="Device" Cgroup="Driver" Csub="ADC12B" Cversion="1.0.0" condition="A8107M0">
      <description>ADC12B driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/ADC12B.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/ADC12B.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="DualTimer" Cversion="1.0.0" condition="A8107M0">
      <description>DualTimer driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/DualTimer.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/DualTimer.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="GPIO" Cversion="1.0.0" condition="A8107M0">
      <description>GPIO driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/GPIO.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/GPIO.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="I2CM" Cversion="1.0.0" condition="A8107M0">
      <description>I2CM driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/I2CM.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/I2CM.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="I2CS" Cversion="1.0.0" condition="A8107M0">
      <description>I2CS driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/I2CS.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/I2CS.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="MPULCD" Cversion="1.0.0" condition="A8107M0">
      <description>MPULCD driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/MPULCD.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/MPULCD.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="PWM" Cversion="1.0.0" condition="A8107M0">
      <description>PWM driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/PWM.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/PWM.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="RTC" Cversion="1.0.0" condition="A8107M0">
      <description>RTC driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/RTC.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/RTC.c" attr="config" condition="A8107M0" version="1.0.0"/>
				<file category="header" name="Device/A8107M/Tools/include/Systick_Delay.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Tools/source/Systick_Delay.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
