XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Amiccom.SoC_DFP.pdsc
		<component Cclass="Device" Cgroup="Driver" Csub="SLPTimer" Cversion="1.0.0" condition="A8107M0">
      <description>SLPTimer driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/SLPTimer.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/SLPTimer.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="SPI" Cversion="1.0.0" condition="A8107M0">
      <description>SPI driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/SPI.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/SPI.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="Timer" Cversion="1.0.0" condition="A8107M0">
      <description>Timer driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/Timer.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/Timer.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="UART" Cversion="1.0.0" condition="A8107M0">
      <description>UART driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/UART.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/UART.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="WatchDog" Cversion="1.0.0" condition="A8107M0">
      <description>WatchDog driver for A8107M0 Device</description>
      <files>
        <file category="header" name="Device/A8107M/Driver/include/WatchDog.h" condition="A8107M0"/>
        <file category="source" name="Device/A8107M/Driver/source/WatchDog.c" attr="config" condition="A8107M0" version="1.0.0"/>
      </files>
    </component>
   		
		
		<!-- A3107M0 Device:Driver component -->
    <component Cclass="Device" Cgroup="Driver" Csub="ADC12B" Cversion="1.0.0" condition="A3107M0">
      <description>ADC12B driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/ADC12B.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/ADC12B.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="DualTimer" Cversion="1.0.0" condition="A3107M0">
      <description>DualTimer driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/DualTimer.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/DualTimer.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="GPIO" Cversion="1.0.0" condition="A3107M0">
      <description>GPIO driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/GPIO.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/GPIO.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="MPULCD" Cversion="1.0.0" condition="A3107M0">
      <description>MPULCD driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/MPULCD.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/MPULCD.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="PWM" Cversion="1.0.0" condition="A3107M0">
      <description>PWM driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/PWM.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/PWM.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="RTC" Cversion="1.0.0" condition="A3107M0">
      <description>RTC driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/RTC.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/RTC.c" attr="config" condition="A3107M0" version="1.0.0"/>
				<file category="header" name="Device/A3107M/Tools/include/Systick_Delay.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Tools/source/Systick_Delay.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="SLPTimer" Cversion="1.0.0" condition="A3107M0">
      <description>SLPTimer driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/SLPTimer.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/SLPTimer.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="SPI" Cversion="1.0.0" condition="A3107M0">
      <description>SPI driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/SPI.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/SPI.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="Timer" Cversion="1.0.0" condition="A3107M0">
      <description>Timer driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/Timer.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/Timer.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
		<component Cclass="Device" Cgroup="Driver" Csub="UART" Cversion="1.0.0" condition="A3107M0">
      <description>UART driver for A3107M0 Device</description>
      <files>
        <file category="header" name="Device/A3107M/Driver/include/UART.h" condition="A3107M0"/>
        <file category="source" name="Device/A3107M/Driver/source/UART.c" attr="config" condition="A3107M0" version="1.0.0"/>
      </files>
    </component>
